BusinessProcesses/БПСогласование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<BusinessProcess>
		<Properties>
			<Name>БПСогласование</Name>
			<Task>Task.Согласование</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Счет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходнаяНакладная</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Documents/Счет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>Счет</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаСогласована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Материалы</Name>
					<Comment>тч материалы счет</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<BasedOn>
				<xr:Item>Document.Счет</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Покупатели</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Счет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойствКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РасчетныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Себестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

BusinessProcesses/БПСогласование/Ext/ObjectModule.bsl
Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	// Проверка заполнения полей БП
	НужноЗаписать=Ложь;
	Если ЭтотОбъект.Счет.Пустая() Тогда
		СчетОбъект = Документы.Счет.СоздатьДокумент();
		СчетОбъект.Дата = ТекущаяДата();
		СчетОбъект.Записать();
		
		ЭтотОбъект.Счет=СчетОбъект.Ссылка;
		НужноЗаписать = Истина;
	КонецЕсли;
	
	Если НужноЗаписать Тогда
		Записать();
	КонецЕсли;
	
	Сообщить("Старт бизнес-процесса:"+""""+ЭтотОбъект.Метаданные().Синоним+"""");
	
КонецПроцедуры

Процедура ВыпискаСчетаПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ФормированиеЗадачиВыпискаСчета (ФормируемыеЗадачи, СтандартнаяОбработка);

КонецПроцедуры

Процедура ФормированиеЗадачиВыпискаСчета (ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	// Формирование задачи ВЫПИСКА СЧЕТА
	Задача = Задачи.Согласование.СоздатьЗадачу();
	Задача.Дата = ТекущаяДата();
	Задача.БизнесПроцесс = Ссылка;
	Задача.ТочкаМаршрута=БизнесПроцессы.БПСогласование.ТочкиМаршрута.ВыпискаСчета;
	Задача.Наименование = "Выписка счета"; 

	 
	Задача.Подразделение = Справочники.Подразделения.ОтделПродаж; 
	Задача.Должность = Справочники.Должности.Менеджер;
	Задача.Записать();

	ФормируемыеЗадачи.Добавить(Задача);

	// создание ДОКУМЕНТА "Счет"

	//Документ = Документы.Счет.СоздатьДокумент();
	//Документ.Дата = ТекущаяДата();
	//Документ.Записать();

	// Запись ссылки на СЧЕТ в текущем БП
	//Счет = Документ.Ссылка;
	ЭтотОбъект.Записать();

	// Запись ссылки на СЧЕТ в текущей задаче 
	//Задача.Счет= Документ.Ссылка;
	Задача.Записать();  

КонецПроцедуры

Процедура Условие1ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)    
	
	СкидкаБольшеОбычной = Ложь;
	ОбычнаяСкидка = Константы.ОбычнаяСкидка.Получить();

	//проверяем, что скидка не превышает обычную
	Для каждого стр Из Счет.ТЧ_Материалы Цикл 
		Если стр.Скидка > ОбычнаяСкидка Тогда
			СкидкаБольшеОбычной = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Результат = СкидкаБольшеОбычной;	
КонецПроцедуры

Процедура УтверждениеСчетаПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФормированиеЗадачиУтверждениеСчета (ФормируемыеЗадачи, СтандартнаяОбработка);

КонецПроцедуры  

Процедура ФормированиеЗадачиУтверждениеСчета (ФормируемыеЗадачи, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	// Формирование задачи УТВЕРЖДЕНИЕ СЧЕТА

	Задача = Задачи.Согласование.СоздатьЗадачу();

	Задача.Дата = ТекущаяДата();

	Задача.БизнесПроцесс = Ссылка;

	Задача.ТочкаМаршрута = БизнесПроцессы.БПСогласование.ТочкиМаршрута.УтверждениеСчета;
	Задача.Наименование = "Утверждение счета";

	Задача.Должность = Справочники.Должности.РуководительОтдела;

	Задача.Счет = Счет;

	Задача.Записать();

	ФормируемыеЗадачи.Добавить(Задача);
КонецПроцедуры

Процедура УтверждениеСчетаПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	Если НЕ Счет.Проведен Тогда
		
		СтандартнаяОбработка= Ложь;
		Сообщить("Документ-счет не проведен --- невозможно выполнить задачу!!!");
		Отказ=Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Условие2ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)

	Результат=Счет.СкидкаСогласована;	
	
КонецПроцедуры

Процедура ПолучениеНаличнойОплатыПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФормированиеЗадачиПолученияНаличнойОплаты (ФормируемыеЗадачи, СтандартнаяОбработка);

КонецПроцедуры

Процедура ФормированиеЗадачиПолученияНаличнойОплаты (ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	// Формирование задачи НАЛИЧНОЙ ОПЛАТЫ
	Задача = Задачи.Согласование.СоздатьЗадачу();
	Задача.Дата = ТекущаяДата();
	Задача.БизнесПроцесс = Ссылка;
	Задача.ТочкаМаршрута = БизнесПроцессы.БПСогласование.ТочкиМаршрута.ПолучениеНаличнойОплаты;
	Задача.Наименование = "Получение наличной оплаты";
	Задача.Должность = Справочники.Должности.Кассир;
	Задача.Счет = Счет;
	Задача.Записать();

	ФормируемыеЗадачи.Добавить(Задача);

	// создание ДОКУМЕНТА "Расходная накладная"

	Документ = Документы.РасходнаяНакладная.СоздатьДокумент();

	Документ.Дата = ТекущаяДата();

	Документ.Склад = Счет.Склад;

	Документ.ДокументОснование = Счет.Ссылка;

	Документ.СуммаДокумента = Счет.СуммаДокумента; 
	Документ.Контрагент=Счет.Контрагент;
	
	Документ.Валюта = Счет.Валюта;

	Документ.Курс = Счет.Курс;

	Для Каждого ТекСтрокаТЧ_Материалы Из Счет.ТЧ_Материалы Цикл
		НоваяСтрока = Документ.ТЧ_Материалы.Добавить();
		НоваяСтрока.Материал = ТекСтрокаТЧ_Материалы.Материал;
		НоваяСтрока.Количество = ТекСтрокаТЧ_Материалы.Количество;
		НоваяСтрока.Сумма = ТекСтрокаТЧ_Материалы.Сумма;
		НоваяСтрока.Цена = ТекСтрокаТЧ_Материалы.Цена;
		НоваяСтрока.Скидка = ТекСтрокаТЧ_Материалы.Скидка;

	КонецЦикла;	 

	Документ.Записать();

	// запись ссылки на РН в текущем БП
	РасходнаяНакладная = Документ.Ссылка;
	ЭтотОбъект.Записать();

	// запись ссылки на РН в текущей задаче
	Задача.РасходнаяНакладная = Документ.Ссылка;
	Задача.Записать();
КонецПроцедуры

Процедура ОтгрузкаТовараСоСкладаПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ФормированиеЗадачиОтгрузкиТовара(ФормируемыеЗадачи, СтандартнаяОбработка);

КонецПроцедуры
Процедура ФормированиеЗадачиОтгрузкиТовара (ФормируемыеЗадачи, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	// Формирование задачи ОТГРУЗКИ ТОВАРА

	Задача = Задачи.Согласование.СоздатьЗадачу() ;

	Задача.Дата = ТекущаяДата();

	Задача.БизнесПроцесс = Ссылка;

	Задача.ТочкаМаршрута = БизнесПроцессы.БПСогласование.ТочкиМаршрута.ОтгрузкаТовараСоСклада;
	Задача.Наименование = "Отгрузка товара со склада";

	Задача.Подразделение = Справочники.Подразделения.Склад;
	Задача.Должность = Справочники.Должности.Кладовщик;
	Задача.Счет = Счет;

	Задача.РасходнаяНакладная = РасходнаяНакладная;

	Задача.Записать();

	ФормируемыеЗадачи.Добавить(Задача);

КонецПроцедуры

Процедура ОтгрузкаТовараСоСкладаПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
		
	Если НЕ РасходнаяНакладная.Проведен Тогда
		
		СтандартнаяОбработка= Ложь;
		Сообщить("Расходная накладная не проведен --- невозможно выполнить задачу!!!");
		Отказ=Истина;
		
	КонецЕсли;
КонецПроцедуры
